package main

import (
	"flag"
	"fmt"
	"os"
)

/*
=== Утилита sort ===

Отсортировать строки (man sort)
Основное

Поддержать ключи

-k — указание колонки для сортировки
-n — сортировать по числовому значению
-r — сортировать в обратном порядке
-u — не выводить повторяющиеся строки

Дополнительное

Поддержать ключи

-M — сортировать по названию месяца
-b — игнорировать хвостовые пробелы
-c — проверять отсортированы ли данные
-h — сортировать по числовому значению с учётом суффиксов

Программа должна проходить все тесты. Код должен проходить проверки go vet и golint.
*/

func main() {

	args := os.Args[1:] //получаем аргументы с терминала
	if len(args) == 0 {
		panic("NO argument")
		return
	}
	flag.Bool("da", false, "")
	flag.Parse()
	fileName := args[0] //имя файла
	//file, err := os.Open(fileName)
	//if err != nil {
	//	panic(err)
	//}
	//defer file.Close()
	fmt.Println(fileName)
}
